Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ནི་དམིགས་པའོ།
en: Auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, mental consciousness, mentally compounded sensory contact [and so forth], and feelings conditioned by mentally compounded sensory contact [and so forth], all constitute apprehending.

source: །སའི་ཁམས་དང་ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་དང་། ནམ་མཁའི་ཁམས་དང་། རྣམ་པར་ཤེས་པའི་ཁམས་ནི་དམིགས་པའོ།
en: The earth element, the water element, the fire element, the wind element, the space element, and the consciousness element constitute apprehending.

source: །མ་རིག་པ་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་དང་། མིང་དང་གཟུགས་དང་སྐྱེ་མཆེད་དྲུག་དང་། རེག་པ་དང་ཚོར་བ་དང་སྲེད་པ་དང་ལེན་པ་དང་། སྲིད་པ་དང་སྐྱེ་བ་དང་རྒ་ཤི་ནི་དམིགས་པའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: Fundamental ignorance, formative predispositions, consciousness, name and form, the six sense fields, sensory contact, sensation, craving, grasping, the rebirth process, actual birth, and aging and death constitute apprehending.

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་དམིགས་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་དམིགས་པ་སྟེ་སྐྱོན་ནོ། །རབ་འབྱོར་སྐྱོན་མེད་པ་ནི་གང་ལ་གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་།
en: All the perfections, all the aspects of emptiness, all the factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas all constitute apprehending. [

source: རྣམ་པར་ཤེས་པ་དང་། སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: All the goals], up to and including all-aspect omniscience, constitute apprehending.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: These are indicative of the immaturity [of bodhisattva great beings]. “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དང་། ཆོས་དེ་དག་གི་བརྗོད་པ་ཡང་དམིགས་སུ་མེད་པའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་གཟུགས་ལ་རང་བཞིན་མེད་དེ་གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ།
en: If you ask why, Subhūti, it is because physical forms are without inherent existence, and whatever is without inherent existence is indescribable.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ལ་རང་བཞིན་མེད་དེ། གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are without inherent existence, and whatever is without inherent existence is indescribable.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་རང་བཞིན་མེད་དེ། གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ།
en: The sense fields, the sensory elements, and the links of dependent origination are without inherent existence, and whatever is without inherent existence is indescribable. {

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་རང་བཞིན་མེད་དེ། གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: VII: 38} All the perfections, all the aspects of emptiness, and all the factors conducive to enlightenment are without inherent existence, and whatever is without inherent existence is indescribable.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་རང་བཞིན་མེད་དེ།
en: The noble truths, the meditative concentrations, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are without inherent existence, and whatever is without inherent existence is indescribable.

source: གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་རང་བཞིན་མེད་དེ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are without inherent existence, and whatever is without inherent existence is indescribable. [

source: གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་རང་བཞིན་མེད་དེ། གང་ལ་རང་བཞིན་མེད་པ་དེ་ནི་བརྗོད་དུ་མེད་པའོ།
en: All the goals], up to and including all-aspect omniscience, are without inherent existence, and whatever is without inherent existence is indescribable.

source: །རབ་འབྱོར་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྐྱོན་མེད་པ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱོན་མེད་པར་ཞུགས་པའི་ཏིང་ངེ་འཛིན་དང་།
en: These, Subhūti, are indicative of the maturity of bodhisattva great beings. “

source: སྙོམས་པར་ཞུགས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དེ་ནི། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་དབང་གིས་ཀྱང་མི་སྐྱེ་ན། འདོད་ཆགས་སམ། ཞེ་སྡང་ངམ། གཏི་མུག་གིས་སྐྱེ་བར་འགྱུར་ཞིང་དེ་ལ་གནས་ཏེ། དེའི་ལས་མངོན་པར་འདུ་བྱེད་པ་དང་། ལས་དེ་མངོན་པར་འདུ་བྱེད་པས། འགྲོ་བ་ལྔའི་འཁོར་བར་ལྟུང་བར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: If bodhisattva great beings perfect all the meditative stabilities and meditative absorptions that enter into this maturity, and indeed will not be reborn on account of these meditative stabilities and meditative absorptions, how could they possibly be reborn through desire, hatred, or delusion, let alone lapse into cyclic existence with its five types of living beings due to the conditioning of past actions, while maintaining [those stabilities and absorptions]!

source: དེ་ནི་གནས་མེད་དོ། །གཞན་དུ་ན་སྒྱུ་མ་ལྟ་བུའི་ཆོས་རྣམས་ལ་གནས་ཤིང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱེད་དེ། སེམས་ཅན་ནམ་སྒྱུ་མར་ཡང་དམིགས་པ་མེད་དོ།
en: On the contrary, they dwell in attributes that are like a magical display, and act for the benefit of all beings, but they do not apprehend either beings or their magical display.

source: །དེ་སེམས་ཅན་དང་སྒྱུ་མ་མི་དམིགས་པས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏེ།
en: Since they do not apprehend beings or their magical display, they indeed bring beings to maturation and acquire the buddhafields.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་བར་དུ་སྟེ། མི་དམིགས་པའི་འཁོར་ལོ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་འཁོར་ལོ་སྐོར་རོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they complete the perfection of meditative stability, and from then, as long as they turn the wheel of the Dharma, they turn the wheel of emptiness, signlessness, and wishlessness, which is without apprehending. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་ཡོངས་སུ་ཤེས་སོ། །ཆོས་ཐམས་ཅད་སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they comprehend all phenomena in the manner of a dream, and they comprehend all phenomena in the manner of an echo, in the manner of an optical aberration, in the manner of a magical display, in the manner of a mirage, and in the manner of a phantom.” “

source: སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུར་ཡོངས་སུ་ཤེས་སོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་འཚལ་བ་ལགས།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they definitively comprehend that all phenomena are like a dream.

source: ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་སྒྲ་བརྙན་ལྟ་བུ་དང་། མིག་ཡོར་ལྟ་བུ་དང་། སྒྱུ་མ་ལྟ་བུ་དང་། སྨིག་རྒྱུ་ལྟ་བུ་དང་། སྤྲུལ་པ་ལྟ་བུར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་འཚལ་བ་ལགས།
en: How do they definitively comprehend that all phenomena are like an echo, like an optical aberration, like a magical display, like a mirage, and like a phantom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྨི་ལམ་མི་མཐོང་ངོ་། །རྨི་ལམ་མཐོང་བ་མི་མཐོང་ངོ་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, they do not see dreams and they do not see viewers of dreams.

source: །སྒྲ་བརྙན་མི་ཐོས་སོ། །སྒྲ་བརྙན་ཉན་པ་མི་མཐོང་ངོ་།
en: They do not hear echoes and they do not see hearers of echoes.

source: །མིག་ཡོར་མི་མཐོང་ངོ་། །མིག་ཡོར་མཐོང་བ་མི་མཐོང་ངོ་།
en: They do not see optical aberrations and they do not see viewers of optical aberrations.

source: །སྒྱུ་མ་མི་མཐོང་ངོ་། །སྒྱུ་མ་མཐོང་བ་མི་མཐོང་ངོ་།
en: They do not see magical displays and they do not see viewers of magical displays. {

source: །སྨིག་རྒྱུ་མི་མཐོང་ངོ་། །སྨིག་རྒྱུ་མཐོང་བ་མི་མཐོང་ངོ་།
en: Ki.VII: 39} They do not see mirages and they do not see viewers of mirages.

source: །སྤྲུལ་པ་མི་མཐོང་ངོ་། །སྤྲུལ་པ་མཐོང་བ་མི་མཐོང་ངོ་།
en: They do not see phantoms and they do not see viewers of phantoms.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ཀྱི་རྨི་ལམ་ནི་ཕྱིན་ཅི་ལོག་གོ །
en: If you ask why, it is because dreams are the erroneous misconceptions of ordinary simple people.

source: སྒྲ་བརྙན་ནི་ཕྱིན་ཅི་ལོག་གོ །
en: Echoes are their erroneous misconceptions.

source: མིག་ཡོར་ནི་ཕྱིན་ཅི་ལོག་གོ །
en: Optical aberrations are their erroneous misconceptions.

source: སྒྱུ་མ་ནི་ཕྱིན་ཅི་ལོག་གོ །
en: Magical displays are their erroneous misconceptions.

source: སྨིག་རྒྱུ་ནི་ཕྱིན་ཅི་ལོག་གོ །སྤྲུལ་པ་ནི་ཕྱིན་ཅི་ལོག་གོ །
en: Mirages are their erroneous misconceptions, and phantoms are their erroneous misconceptions.

source: དགྲ་བཅོམ་པ་ནི་རྨི་ལམ་མི་མཐོང་ངོ་། །རྨི་ལམ་མཐོང་བ་མི་མཐོང་ངོ་།
en: Arhats do not see dreams and they do not see viewers of dreams.

source: །རང་སངས་རྒྱས་ཀྱི་བར་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་རྨི་ལམ་མི་གཟིགས་སོ། །རྨི་ལམ་མཐོང་བ་མི་གཟིགས་སོ།
en: Others], up to and including pratyekabuddhas, as well as bodhisattvas and the tathāgatas, arhats, completely awakened buddhas, do not see dreams and they do not see viewers of dreams.

source: །སྒྲ་བརྙན་མི་གསན་ཏོ། །སྒྲ་བརྙན་ཉན་པ་མི་གཟིགས་སོ།
en: They do not hear echoes and they do not see hearers of echoes.

source: །མིག་ཡོར་མི་གཟིགས་སོ། །མིག་ཡོར་མཐོང་བ་མི་གཟིགས་སོ།
en: They do not see optical aberrations and they do not see viewers of optical aberrations.

source: །སྒྱུ་མ་མི་གཟིགས་སོ། །སྒྱུ་མ་མཐོང་བ་མི་གཟིགས་སོ།
en: They do not see magical displays and they do not see viewers of magical displays.

source: །སྨིག་རྒྱུ་མི་གཟིགས་སོ། །སྨིག་རྒྱུ་མཐོང་བ་མི་གཟིགས་སོ།
en: They do not see mirages and they do not see viewers of mirages.

source: །སྤྲུལ་པ་མི་གཟིགས་སོ། །སྤྲུལ་པ་མཐོང་བ་མི་གཟིགས་སོ།
en: They do not see phantoms and they do not see viewers of phantoms.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཡང་དག་པ་མ་ཡིན་པས། ཆོས་ཐམས་ཅད་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་དང་མཉམ་པ་སྟེ།
en: If you ask why, all phenomena have the essential nature of nonentity because they are not genuinely true, equivalent to final nirvāṇa.

source: ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཡོངས་སུ་གྲུབ་པ་མེད་ན།
en: All phenomena are without absolute existence because they are absolutely untrue.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དངོས་པོའི་འདུ་ཤེས་སམ། ཡོངས་སུ་གྲུབ་པའི་འདུ་ཤེས་སམ། ཡང་དག་པའི་འདུ་ཤེས་སུ་འགྱུར་བ་ལྟ་ག་ལ་ཡོད་དེ།
en: In that case, when bodhisattva great beings practice the perfection of wisdom, how could they possibly acquire the notion of an entity, or the notion of absolute existence, or the notion of something that is true?

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། གལ་ཏེ་ཆོས་ལ་ལ་ཞིག་གི་ངོ་བོ་ཉིད་དམ། ཡོངས་སུ་གྲུབ་པ་འམ། ཡང་དག་པར་གྱུར་པ་ཞིག་དམིགས་ན་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པར་ཡང་མི་འགྱུར་ཏེ།
en: If you ask why, it would not be the perfection of wisdom if one were to apprehend the essential nature, absolute existence, or authenticity of anything.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་དེ་ལྟར་སྤྱོད་ན། གཟུགས་ལ་ཆགས་པ་མེད་དོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་ཆགས་པ་མེད་དོ།
en: When bodhisattva great beings practice the perfection of wisdom in this manner, they are not attached to physical forms, and they are not attached to feelings, perceptions, formative predispositions, or consciousness.

source: །ཁམས་དང་སྐྱེ་མཆེད་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the sense fields, the sensory elements, or the links of dependent origination.

source: །འདོད་པའི་ཁམས་ལ་ཆགས་པ་མེད་དོ། །གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ལ་ཆགས་པ་མེད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the realm of desire, and they are not attached to the realm of form or the realm of formlessness.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the perfection of generosity, and they are not attached to the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, or the perfection of wisdom.

source: །ནང་སྟོང་པ་ཉིད་ལ་ཆགས་པ་མེད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the emptiness of internal phenomena, and they are not attached to [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་ཆགས་པ་མེད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They are not attached to the thirty-seven factors conducive to enlightenment.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུགས་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers.

source: །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ཆགས་པ་མེད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: They are not attached to the meditative stabilities or the dhāraṇī gateways.

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་ཆགས་པ་མེད་དོ།
en: They are not attached to [the goals], up to and including all-aspect omniscience. “

source: །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་། ས་དང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ལ་འདོད་པའི་འདོད་ཆགས་མི་སྐྱེད་དོ།
en: Abiding in this perfection of wisdom, they perfect the first [bodhisattva] level, without any longing for it arising.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ས་དེ་ཡང་མི་དམིགས་ན། དེ་ལ་འདོད་པའི་འདོད་ཆགས་སྐྱེད་པར་ལྟ་ག་ལ་འགྱུར་ཏེ།
en: If you ask why, since they do not even apprehend that level, how could longing for it possibly arise!

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་གནས་ཤིང་། ས་གཉིས་པ་དང་། ས་གསུམ་པ་དང་། ས་བཞི་པ་དང་། ས་ལྔ་པ་དང་། ས་དྲུག་པ་དང་།
en: Abiding in this perfection of wisdom, they perfect the second level, the third level, the fourth level, the fifth level, {Ki.

source: ས་བདུན་པ་དང་། ས་བརྒྱད་པ་དང་། ས་དགུ་པ་དང་། ས་བཅུ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ། དེ་ལ་འདོད་པའི་འདོད་ཆགས་མི་སྐྱེད་དོ།
en: VII: 40} the sixth level, the seventh level, the eighth level, the ninth level, and the tenth level, without any longing for them arising.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཡང་མི་དམིགས་སོ།
en: While practicing the perfection of wisdom, they do not even apprehend this perfection of wisdom.

source: །དེ་མི་དམིགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེར་ཆོས་ཐམས་ཅད་ཀྱང་འདུས་པར་མཐོང་སྟེ། ཆོས་དེ་དག་ཀྱང་མི་དམིགས་སོ།
en: When they practice the perfection of wisdom that is without apprehending, they perceive that all phenomena are indeed gathered within this perfection of wisdom, but they do not at all apprehend these phenomena.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་དེ་དག་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དེ་ལ་གཉིས་སུ་མེད་དེ། གཉིས་སུ་བྱར་མེད་དོ།
en: If you ask why, it is because these phenomena and the perfection of wisdom are nondual and indivisible.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་དེ་དག་ནི་ཐ་དད་དུ་བྱ་བ་གང་ཡང་མེད་དེ།
en: If you ask why, it is because these phenomena are not to be at all differentiated.

source: ཆོས་ཀྱི་དབྱིངས་སུ་བསྟན་པ་དང་། དེ་བཞིན་ཉིད་དུ་བསྟན་པ་དང་ཡང་དག་པའི་མཐར་བསྟན་པས། ཆོས་ཐམས་ཅད་དབྱེར་མེད་དོ།
en: Indeed, all phenomena are indivisible because they denote the realm of phenomena, they denote the real nature, and they denote the very limit of reality.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་ཆོས་ཐམས་ཅད་དབྱེར་མ་མཆིས་པ་ལགས་ན། ཇི་ལྟར་དགེ་བ་དང་མི་དགེ་བའི་ཆོས་རྣམས་བསྟན་པ་ལགས།
en: Blessed Lord, since all phenomena are indivisible, how are phenomena revealed to be virtuous or nonvirtuous?

source: ཇི་ལྟར་འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་བསྟན་པ་ལགས། ཇི་ལྟར་ཟག་པ་དང་བཅས་པ་དང་།
en: How are phenomena revealed to be mundane or supramundane?

source: ཟག་པ་མ་མཆིས་པའི་ཆོས་རྣམས་བསྟན་པ་ལགས། ཇི་ལྟར་འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་བསྟན་པ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: How are phenomena revealed to be contaminated or uncontaminated?

source: ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ལ། འདུས་བྱས་སམ། འདུས་མ་བྱས་སམ། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་འམ།
en: How are phenomena revealed to be conditioned or unconditioned?” “

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་འམ། བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་བརྗོད་དུ་ཡོད་དམ།
en: Subhūti,” replied the Blessed One, “do you think that with regard to the reality of all phenomena there exists the description of anything—conditioned or unconditioned, or similarly, pertaining to the fruit of entering the stream to nirvāṇa, or the fruit of being destined for only one more rebirth, or the fruit of no longer being subject to rebirth, or arhatship, individual enlightenment, or even the bodhisattvas?” “

source: རབ་འབྱོར་དེ་བས་ན་ཁྱོད་ཀྱིས་རྣམ་གྲངས་དེས་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་དབྱེར་མེད་པ་དང་། ཆོས་ཐམས་ཅད་མཚན་ཉིད་མེད་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། འབྱུང་བ་མེད་པར་རིག་པར་བྱའོ།
en: For that reason, Subhūti,” continued the Blessed One, “you should know that all phenomena are indivisible, all phenomena are without defining characteristics, they are nonarising, and they are unoriginated.

source: །རབ་འབྱོར་ང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། གཟུགས་ཞེས་བྱ་བ་འམ། ཚོར་བ་ཞེས་བྱ་བ་འམ། འདུ་ཤེས་ཞེས་བྱ་བ་འམ། འདུ་བྱེད་ཅེས་བྱ་བ་འམ། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འམ། སྐྱེ་མཆེད་དང་ཁམས་དང་
en: Subhūti, formerly, when I engaged in the conduct of a bodhisattva, I did not apprehend the inherent existence of anything at all—‘physical forms,’ ‘feelings,’ ‘perceptions,’ ‘formative predispositions,’ ‘consciousness,’ ‘sense fields, sensory elements, and links of dependent origination,’ ‘all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment,’ ‘[all the fruitional attributes], up to and including the distinct qualities of the buddhas,’ ‘virtuous and nonvrtuous attributes,’ ‘afflicted, unafflicted, mundane, supramundane, contaminated, uncontaminated, common, uncommon, conditioned, and unconditioned attributes,’ or ‘the fruit of entering the stream to nirvāṇa,’ ‘the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, or arhatship,’ or ‘individual enlightenment,’ or ‘[the other goals], up to and including all-aspect omniscience.’

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱ་བ་འམ། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་བར་ཞེས་བྱ་བ་འམ། དགེ་བ་དང་། མི་དགེ་བའི་ཆོས་རྣམས་ཞེས་བྱ་བ་འམ། ཉོན་མོངས་པ་དང་བཅས་པ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། ཐུན་མོང་དང་། ཐུན་མོང་མ་ཡིན་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཞེས་བྱ་བ་འམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཞེས་བྱ་བ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ཅེས་བྱ་བ་འམ། རང་བྱང་ཆུབ་ཅེས་བྱ་བ་འམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཞེས་བྱ་བ་ཆོས་གང་གི་རང་བཞིན་ཡང་མི་དམིགས་སོ། །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་མཁས་པར་བྱའོ།
en: So it is, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, starting from the time when they first begin to set their mind [on enlightenment], until they attain consummate buddhahood in unsurpassed, complete enlightenment, that they should be skillful with regard to the essential nature of all phenomena, without apprehending anything. {

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་མཁས་པ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: Ki.VII: 41} Skillful with regard to the essential nature of all phenomena, bodhisattva great beings perfect the path of enlightenment, and bring beings to maturation and acquire the buddhafields.

source: །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་འཛིན་ཏོ། །དེ་ལ་གནས་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཅི་ནས་ཀྱང་དུལ་བར་གྱུར་ནས། སྲིད་པ་གསུམ་ན་མི་སྣང་བ་དེ་ལྟར་རྣམ་པར་བཏུལ་ལོ།
en: Abiding in them, they attain consummate buddhahood in unsurpassed, complete enlightenment, and then in various ways they also instruct beings so that they are disciplined, and no longer appear within the three levels of existence.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མཚན་མ་མེད་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings should train in this perfection of wisdom in a manner that is signless.”
